// 已知一个首项大于0的增等差数列的前四项和为26，前四项的积为880，求此数列。
// **输出格式要求："%d, "   "......\n" (只输出前21个数，其他为......)
// 程序运行示例如下：
// 2, 5, 8, 11, 14, 17, 20, 23, 26, 29, 32, 35, 38, 41, 44, 47, 50, 53, 56, 59, 62, ......

#include<stdio.h>
 
int main()
 
{
    int a,d,sum,mul,i;
    sum = 0;
    mul = 1;
    for(d=1;d<=5;d++)
    {
        for(a=1;a<=5;a++)
        {
            sum = a + (a + d) + (a + 2 * d) + (a + 3 * d);
            mul = a * (a + d) * (a + 2 * d) * (a + 3 * d);
             if(sum==26&&mul==880)
            {
                for (i = 0; i <= 20; ++i)
                {
                    printf("%d,", a + i * d);
                }
                printf("......\n");
            }
        }
    }
        return 0;
}